{
  "format": "graph-model",
  "generatedBy": "TensorFlow.js v4.22.0",
  "convertedBy": "Brainy download-model script",
  "modelTopology": {
    "class_name": "GraphModel",
    "config": {
      "name": "universal-sentence-encoder"
    }
  },
  "userDefinedMetadata": {
    "signature": {
      "inputs": {
        "inputs": {
          "name": "inputs",
          "dtype": "string",
          "shape": [
            -1
          ]
        }
      },
      "outputs": {
        "outputs": {
          "name": "outputs",
          "dtype": "float32",
          "shape": [
            -1,
            512
          ]
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "embedding_matrix",
          "shape": [
            512,
            512
          ],
          "dtype": "float32"
        }
      ]
    }
  ],
  "modelUrl": "https://tfhub.dev/tensorflow/tfjs-model/universal-sentence-encoder/1/default/1"
}